import pandas as pd

file_path = "C:/Users/Vova/OneDrive/Робочий стіл/Анкетування.xlsx"
df = pd.read_excel(file_path)

faculty_mapping = {
    '274 Автомобільний транспорт': 'Механіки, енергетики та IT',
    '208 Агроінженерія': 'Механіки, енергетики та IT',
    '122 Комп’ютерні науки': 'Механіки, енергетики та IT',
    '133 Галузеве машинобудування': 'Механіки, енергетики та IT',
    '141 Електроенергетика, електротехніка та електромеханіка': 'Механіки, енергетики та IT',
    '145 Відновлювальні джерела енергії та гідроенергетика': 'Механіки, енергетики та IT',
    '174 Автоматизація, комп’ютерно-інтегровані технології та робототехніка': 'Механіки, енергетики та IT',
    '126 Інформаційні системи та технології': 'Механіки, енергетики та IT',
    
    '51 Економіка': 'Управління, економіки та права',
    '71 Облік і оподаткування': 'Управління, економіки та права',
    '72 Фінанси, банківська справа, страхування та фондовий ринок': 'Управління, економіки та права',
    '73 Менеджмент': 'Управління, економіки та права',
    '75 Маркетинг': 'Управління, економіки та права',
    '76 Підприємництво та торгівля': 'Управління, економіки та права',
    '81 Право': 'Управління, економіки та права',
    
    '193 Геодезія та землеустрій': 'Землевпорядкування та туризму',
    '242 Туризм і рекреація': 'Землевпорядкування та туризму',
    
    '191 Архітектура та містобудування': 'Будівництва та архітектури',
    '22 Дизайн середовища': 'Будівництва та архітектури',
    '192 Будівництво та цивільна інженерія': 'Будівництва та архітектури',
  
    '203 Садівництво, плодоовочівництво та виноградарство': 'Агротехнологій та екології',
    '206 Садово-паркове господарство': 'Агротехнологій та екології',
    '201 Агрономія': 'Агротехнологій та екології',
    '101 Екологія': 'Агротехнологій та екології',
    '183 Технології захисту навколишнього середовища': 'Агротехнологій та екології',
    '202 Захист і карантин рослин': 'Агротехнологій та екології',
    
}


df['Факультет'] = df['Яку спеціальність ви обрали для вступу в ел. кабінеті?'].map(faculty_mapping)

df_cleaned = df.dropna(subset=['Факультет'])
missing_specialties = df[df['Факультет'].isna()]['Яку спеціальність ви обрали для вступу в ел. кабінеті?'].unique()
if len(missing_specialties) > 0:
    print("Не знайдено факультетів для наступних спеціальностей:")
    for specialty in missing_specialties:
        print(specialty)

output_file_path = 'updated_excel_file.xlsx'
df.to_excel(output_file_path, index=False)
print("Файл успішно збережено:", output_file_path)
